{
    "jobs": [
        {
            "job_title": "Full Stack Developer (Python/Node/React)",
            "employer_name": "Dexian",
            "job_description": "4 DAYS ONSITE PER WEEK (HYBRID) - MUST BE LOCAL TO WASHINGTON DC-BALTIMORE AREA\n\nJob Description:\n\nFull Stack Developer (Node/Python/React)\n\nWe are seeking a strong Full Stack Developer with expertise in Node or Python for backend development and React for frontend development.\n• Requirements:\n• Bachelor's degree with a minimum of 7 years of professional experience\n• Strong understanding of Node.js core concepts, including components, state management, and lifecycle methods\n• Proven ability to build reusable and efficient components\n• Expertise in backend development using .NET or Node.js\n• Experience developing APIs, managing server-side data, and handling data flow between frontend and backend\n• Strong knowledge of React\n• Familiarity with cloud repositories; experience in Agile environments preferred\n• Experience with testing frameworks such as JUnit or NUnit\n• Skilled in debugging and troubleshooting\n• Clear understanding and implementation experience of authentication and authorization\n• Experience with generative AI is a plus\n\nDexian is a leading provider of staffing, IT, and workforce solutions with over 12,000 employees and 70 locations worldwide. As one of the largest IT staffing companies and the 2nd largest minority-owned staffing company in the U.S., Dexian was formed in 2023 through the merger of DISYS and Signature Consultants. Combining the best elements of its core companies, Dexian's platform connects talent, technology, and organizations to produce game-changing results that help everyone achieve their ambitions and goals.\n\nDexian's brands include Dexian DISYS, Dexian Signature Consultants, Dexian Government Solutions, Dexian Talent Development and Dexian IT Solutions. Visit https://dexian.com/ to learn more.\n\nDexian is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status.",
            "job_apply_link": "https://dexian.com/jobs/full-stack-developer-pythonnodereact-12124/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 20
        },
        {
            "job_title": "Full Time: Java Developer/Lead",
            "employer_name": "Visionary Innovative Technology Solutions LLC",
            "job_description": "Position: Java Developer/Lead\n\nLocation: Reston, VA (Onsite)\n\nDuration: Full Time\n\nJob Description:\n\n9-10 years of Programming experience with Java, J2EE, XML, and Web Services.\n\n• Must have AWS Services such as EC2, S3, containerization, Lambda, SQS, SNS, step functions.\n\n• Experience with An - gular 4/5/6/8 development, Java script, CSS, HTML\n\n• Strong knowledge of Micro services, Spring, Spring Boot, Hibernate, Web services based on REST\n\n• Experience in Agile Scrum software development Methodology\n\n• Experience developing in distributed application environments",
            "job_apply_link": "https://www.linkedin.com/jobs/view/full-time-java-developer-lead-at-visionary-innovative-technology-solutions-llc-4213578851?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 30
        },
        {
            "job_title": "Full-Stack Developer (Node.js | React | Python)",
            "employer_name": "Auzmor",
            "job_description": "At Auzmor, we believe success isn’t just about building great products—it’s about building great people.\n\nWe’re looking for passionate developers who thrive at the intersection of front-end finesse and back-end logic. If you're skilled in Node.js, React, and Python, and are eager to grow your career in a fast-paced, global environment—this is your moment.\n\n👀 Who Should Apply:\n• Developers with 2 - 3+ years of experience as a developer (including internships, freelance, or open-source projects)\n• Self-taught coders or bootcamp grads with solid portfolios in Node.js, React, and Python\n• Problem-solvers who love clean code and scalable architecture\n• Team players ready to learn, build, and grow in a hybrid setup.\n\n💼 What You’ll Do:\n• Build scalable APIs and services using Node.js and Python\n• Develop intuitive UI components using React.js\n• Work with databases (SQL/NoSQL) and modern deployment tools\n• Collaborate across Product, QA, and DevOps teams\n• Contribute to planning, code reviews, and tech decisions\n\n📈 Program Structure:\n\nThis entry-level role begins with a structured internship program designed to set you up for success:\n\n3-Month Unpaid Internship & Training:\n\nGain hands-on experience, training, and mentorship while working closely with our development team.\n\nPotential to Move to a Paid Internship Program (3-6 Months):\n\nUpon completing your unpaid internship and training program, you’ll transition into a paid internship to deepen your skills, take on more responsibility, and prove your potential with a competitive stipend.\n\nPotential to Move to Full-Time Employment:\n\nTop performers will transition into permanent Full-Stack Developer roles, with opportunities for growth and advancement at Auzmor.\n\n💡 Why Auzmor?\n• Build real products used by global teams\n• Be part of a collaborative, high-impact development squad\n• Hybrid work flexibility based in Des Moines, Iowa\n• Clear career path and mentorship from senior engineers\n• Visa sponsorship available for eligible candidates",
            "job_apply_link": "https://www.linkedin.com/jobs/view/full-stack-developer-node-js-react-python-at-auzmor-4216383198?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 40
        },
        {
            "job_title": "Epic Tableau SQL Developer",
            "employer_name": "Deloitte",
            "job_description": "Are you an experienced, passionate pioneer in technology who wants to work in a collaborative environment? As an experienced Epic Tableau SQL Developer you will have the ability to share new ideas and collaborate on projects as a consultant without the extensive demands of travel. If so, consider an opportunity with Deloitte under our Project Delivery Talent Model. Project Delivery Model (PDM) is a talent model that is tailored specifically for long-term, onsite client service delivery.\n\nWork you'll do/Responsibilities\n• Design, develop, and maintain interactive dashboards using Tableau / Power BI for clinical, operational, and financial reporting.\n• Extract, transform, and load (ETL) data from Epic Clarity and Caboodle into Tableau / Power BI.\n• Write and optimize SQL queries to retrieve relevant Epic data efficiently.\n• Collaborate with Epic analysts, clinicians, and business stakeholders to gather requirements and define KPIs.\n• Ensure data integrity, accuracy, and security (e.g., HIPAA compliance).\n• Automate report refreshes and scheduling through Tableau Server or Power BI Service.\n• Troubleshoot performance issues and optimize dashboard load times.\n• Perform other related duties assigned by supervisor\n\nRecruiting for this position will end on May 4, 2025.\n\nThe Team\n\nOperations and Technology Transformation delivers market leading expertise and industry depth by harnessing deep sector knowledge, scaling the power of hybrid services and products, and unlocking the power of Process Bionics to deliver sustainable and impactful solutions to our clients. We advise, design, implement, and deploy innovative and technology enabled solutions focused on \"heart of the business\" issues in specific sectors including Health Care & Life Sciences, Digital Banking & Payments, Investment & Wealth Management, Insurance, Telecom, Media and Energy & Resources.\n\nOur OTT team brings clients the knowledge of industry leaders who understand the relevant processes and technologies for their industry-and apply them with a process and mindset that tailors transformational change to their specific organization.\n\nQualifications\n\nRequired\n• Bachelor's degree, preferably in Computer Science, Information Technology, Computer Engineering, or related IT discipline; or equivalent experience\n• 3+ years of Tableau experience (dashboard creation, data visualization, advanced calculations)\n• 3+ years of experience working in a healthcare/clinical environment\n• Previous experience with T-SQL and PL/SQL\n• Must currently hold an Epic certification (Clarity, Caboodle, etc.)\n• Limited immigration sponsorship may be available\n• Ability to travel 10%, on average, based on the work you do and the clients and industries/sectors you serve\n• Role is remote\n\nPreferred\n• Strong desktop skills including Word, Excel, PowerPoint\n• Analytical ability to manage multiple projects and prioritize tasks into manageable work products\n• Can operate independently or with minimum supervision\n• Excellent Written and Communication Skills\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $75,000 to $115,000.\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\nInformation for applicants with a need for accommodation: https://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.",
            "job_apply_link": "https://jobsus.deloitte.com/washington-dc/epic-tableau-sql-developer/A1B67DC089664412BACECA897317EB00/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 20
        },
        {
            "job_title": "Python Senior Software Engineer",
            "employer_name": "Walmart",
            "job_description": "Position Summary...\n\nWhat you'll do...\n\nAs a part of Walmart Global Tech, you’ll build industry defining reusable customer and partner facing services and products to lead differentiated experiences and revenue. You will be in the unique position to be of service to both our customers (1P as well as 3P) and our associates as a member of this organization supporting all segments of Walmart. If you are the type of person who feels a personal stake in everything that you work on, has a love for data, enjoys solving complex problems, has a passion for privacy, knows how to foster strong relationships and build trust, and works for the success of the entire team.\n\nAbout Team:\nOur team works closely with our US stores and eCommerce business to better serve customers by empowering team members, stores, and merchants with technological innovation. From groceries and entertainment to sporting goods and crafts, Walmart U.S. offers an extensive selection that our customers value, whether they shop online at Walmart.com, through one of our mobile apps, or in-store. Focus areas include customers, stores and employees, in-store service, merchant tools, merchant data science, and search and personalization.\n\nWhat you'll do:\n• Design, build, and maintain high-performance front-end applications for our 1P and 3P customers.\n• Develop robust, maintainable, reusable code for managing functionality, configuration, deployment, monitoring, performance, scalability, availability, security, and alerting for software test, integration, and production environments.\n• Plan and implement a series of steps which potentially includes reconfiguration, integration, removal, or addition of application components to enhance the application's functionality, resiliency, usability, and security.\n• Understand the Business/Stakeholder/Technical requirements and assist in analyzing the existing solutions to address the needs. Assist in creation of simple, modular, extensible functional design for the product/solution in adherence to the requirements.\n• Assess gaps/ updates/ modifications between the customer/business expectations and the existing product/solutions.\n• Analyze defects from past projects/solutions to avoid recurrence of similar defects.\n• Analyze system performance impacting the complete product for non-functional requirements like reliability, operability, performance efficiency and security. Troubleshoot performance and availability bottlenecks for the application.\n• Develop, maintain, and enhance automated test cases (adopting Shift Left practice) and deployment procedures.\n• Follow coding and design best practices developed by the teams and contribute towards their continuous improvement.\n• Plan Hardware Capacity for high traffic business Events.\n• Design Build and maintain Observability aspects of application.\n• Review Peer Code and help create a culture of continuous improvements on the architecture.\n• Work with relevant stakeholders on launching AB tests for different functionalities getting rolled out.\n\nWhat you'll bring:\n• Experience in creating user interfaces using appropriate and relevant technologies (e.g., HTML 5 coding, CSS (Cascading Style Sheets) libraries like Bootstrap, etc.) using best practices and appropriate design patterns.\n• Relevant front end programming experience in relevant languages and frameworks (e.g., Java, Python, JavaScript, Spring, Node, React, Angular etc.)\n• Experience integrating with scalable back-end services (e.g., REST / graph-QL).\n• Experience in functional, integration and E2E (End 2 End) testing tools and practices.\n• Experience with code repositories and version control practices.\n• Experience with CI/CD pipelines and best practices. Automated deployment experience is a plus.\n• Experience in software quality and operational excellence practices.\n• Experience in agile development methodology.\n• Good analytical and problem-solving skills.\n\nAbout Walmart Global Tech\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart an illustrious career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\n\nFlexible, hybrid work:\nWe use a hybrid way of working that is primarily in the office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\n\n#WGTMPQ4\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎\n\n‎\n\n‎\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎\n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎\n\n‎\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎\n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎\nThe annual salary range for this position is $108,000.00-$216,000.00\n\n‎\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎\nAdditional compensation for certain positions may also include:\n\n‎\n\n‎\n- Stock\n\n‎\n\n‎\n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nOption 1: Bachelor's degree in computer science, computer engineering, computer information systems, software engineering, or related area and 3 years’ experience in software engineering or related area.Option 2: 5 years’ experience in software engineering or related area.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMaster’s degree in Computer Science, Computer Engineering, Computer Information Systems, Software Engineering, or related area and 1 year's experience in software engineering or related area., We value candidates with a background in creating inclusive digital experiences, demonstrating knowledge in implementing Web Content Accessibility Guidelines (WCAG) 2.2 AA standards, assistive technologies, and integrating digital accessibility seamlessly. The ideal candidate would have knowledge of accessibility best practices and join us as we continue to create accessible products and services following Walmart’s accessibility standards and guidelines for supporting an inclusive culture.\n\nPrimary Location...\n\n10790 PARKRIDGE DR. SUITE 200, RESTON, VA 20191, United States of America",
            "job_apply_link": "https://www.ziprecruiter.com/c/Walmart/Job/Python-Senior-Software-Engineer/-in-Arlington,VA?jid=55270763c0e50e4d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 60
        },
        {
            "job_title": "Java Fresher",
            "employer_name": "Green Thumb Systems LLC",
            "job_description": "We are professional and agile. Our work environment includes:\n\nModern office setting Ability to perform in a team environment.\n\nPositive attitude with good communication skills. Java Developer Entry Level Job Duties: Designs and develops user interfaces to internet/intranet applications by setting expectations and features priorities throughout development life cycle; completing programming using languages and software products; designing and conducting tests.\n\nJob Type: Full-time\n\nPay: $65,000.00 - $85,000.00 per year\n\nBenefits:\n• 401(k)\n• Dental insurance\n• Health insurance\n\nSchedule:\n• 8 hour shift\n• Day shift\n\nEducation:\n• Associate (Preferred)\n\nLanguage:\n• English (Preferred)\n\nAbility to Commute:\n• Herndon, VA 20171 (Preferred)\n\nAbility to Relocate:\n• Herndon, VA 20171: Relocate before starting work (Preferred)\n\nWork Location: In person",
            "job_apply_link": "https://www.indeed.com/viewjob?jk=75b206692d903dc2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 10
        },
        {
            "job_title": "Java FS Developer with React & SQL Exp @ Jersey City, NJ (Need local, F2F Must)",
            "employer_name": "Jobs via Dice",
            "job_description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, LTIMindtree, is seeking the following. Apply via Dice today!\n\nAbout US: LTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700+ clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by nearly 90,000 talented and entrepreneurial professionals across more than 30 countries, LTIMindtree a Larsen & Toubro Group company combines the industry-acclaimed strengths of erstwhile Larsen and Toubro Infotech and Mindtree in solving the most complex business challenges and delivering transformation at scale. For more information, please visit ;/p>\n\nPosition: Java FS Developer with React & SQL Exp\n\nLocation: Jersey City, NJ (Onsite) // F2F interview must //\n\nDuration: Fulltime.\n\nJob Summary: Roles and Responsibilities:\n\nDesign and develop software modules to meet the business requirements.\n\nAnalyze existing software code and make enhancements for new requirements.\n\nWork under limited guidance.\n\nActively Think About System Stability And Enhancing Our Applications.\n\nUnderstand and deeply focus on the real-world benefit your systems and products will have on our end users.\n\nA strong desire to document and share work done to aid in long-term support.\n\nSkill and Experience:\n\n7+ years of experience in testing, documentation, production support, applications development, modern web applications using Rest API, caching, Kafka and J2EE/JAVA Architecture.\n\nStrong experience in Spring Framework such as Spring MVC, IOC, AOP and Spring JDBC.\n\nExperience in building Restful web API with Spring, Spring Boot.\n\nExperience in designing front end interfaces using HTML5, CSS3, JavaScript, Bootstrap, React.\n\nUnit and integration testing using Junit and Mockito.\n\nFamiliar with DevOps tools and experience in CI/CD software.\n\nExperience in database systems like SQL Server and PostgreSQL is a must.\n\nExperience with source control system like GIT (preferred), Perforce or similar.\n\nExperience in Python will be a plus.\n\nGood problem solving, intellectual curiosity and analytical abilities.\n\nTakes full ownership of his/her work and delivers with high standards.\n\nDemonstrates good communication skills and comfortable working with many teams.\n\nSkills\n\nMandatory Skills: Hibernate, Java, JavaScript, Microservices, React, Spring Boot & MS SQL, PostgreSQL.\n\nBenefits/perks listed below may vary depending on the nature of your employment with LTIMindtree ( LTIM ):\n\nBenefits and Perks:\n\nComprehensive Medical Plan Covering Medical, Dental, Vision\n\nShort Term and Long-Term Disability Coverage\n\n401(k) Plan with Company match\n\nLife Insurance\n\nVacation Time, Sick Leave, Paid Holidays\n\nPaid Paternity and Maternity Leave\n\nThe range displayed on each job posting reflects the minimum and maximum salary target for the position across all US locations. Within the range, individual pay is determined by work location and job level and additional factors including job-related skills, experience, and relevant education or training. Depending on the position offered, other forms of compensation may be provided as part of overall compensation like an annual performance-based bonus, sales incentive pay and other forms of bonus or variable compensation.\n\nDisclaimer: The compensation and benefits information provided herein is accurate as of the date of this posting.\n\nLTIMindtree is an equal opportunity employer that is committed to diversity in the workplace. Our employment decisions are made without regard to race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), gender identity or expression, national origin, ancestry, age, family-care status, veteran status, marital status, civil union status, domestic partnership status, military service, handicap or disability or history of handicap or disability, genetic information, atypical hereditary cellular or blood trait, union affiliation, affectional or sexual orientation or preference, or any other characteristic protected by applicable federal, state, or local law, except where such considerations are bona fide occupational qualifications permitted by law.\n\nSafe return to office:\n\nIn order to comply with LTIMindtree s company COVID-19 vaccine mandate, candidates must be able to provide proof of full vaccination against COVID-19 before or by the date of hire. Alternatively, one may submit a request for reasonable accommodation from LTIMindtree s COVID-19 vaccination mandate for approval, in accordance with applicable state and federal law, by the date of hire. Any request is subject to review through LTIMindtree s applicable processes.",
            "job_apply_link": "https://www.linkedin.com/jobs/view/java-fs-developer-with-react-sql-exp-%40-jersey-city-nj-need-local-f2f-must-at-jobs-via-dice-4213945642?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 80
        },
        {
            "job_title": "Javascript / React Developer",
            "employer_name": "Anagh Technologies, Inc.",
            "job_description": "Location: McLean, VA-- 3 Day on-site (Local candidate will get first preference)\n• Description: Must Haves:\nResponsibilities:\n\nTechnical Skills:\n• Must have 7+ years of experience in building large-scale web-based applications using JavaScript/TypeScript, HTML and CSS.\n• Must have 4+ years of strong hands on experience with ReactJS, Redux.\n• Automated unit testing tools such as Jest, Enzyme, React-testing-library and end-to-end testing tools such as, WebDriver IO, Cypress, or other Selenium-based technologies.\n• Develop highly responsive user-facing new features using React.js.\n• Building reusable components and frontend libraries for future use.\n• Understanding business requirements and translate them into intuitive user experiences.\n• Working knowledge of design, mock-up, wireframe tools (Figma, Sketch, UX Pin, Adobe XD, etc.)\n• Translating designs and wireframes into high quality code.\n• Developing flexible and well-structured frontend architecture, along with the APIs to support it.\n• Optimizing existing components for maximum performance.\n• Constructing visualizations that can depict vast amounts of financial data.\n• Manage self-directed assignments to implement features to meet schedule commitments with a high level of quality.\n• 7+ years of professional experience in building large-scale web-based applications using JavaScript/TypeScript, HTML and CSS.\n• 4+ years of strong hands on experience with ReactJS, Redux.\n• Thorough understanding of React.js (JSX), Redux and its core principles.\n• Strong proficiency in JavaScript, JavaScript object model, RESTful APIs, DOM, and the relevant concepts.\n• Proficient understanding of Progress Web Applications (PWA), and Single Page Applications (SPA).\n• Proficiency in front-end development using Vite.js or similar frameworks.\n• Proficient understanding of the React build chain through Webpack/Rollup.\n• Experience with popular modern UI libraries (Bootstrap, Material UI Components, AG grid etc.).\n• Experience with Storybook (Directory of UI components) is a plus.\n• Sufficient knowledge of NodeJS.\n• Experience with modern frontend build pipelines and tools (e.g., dependency management using NPM, YARN, or BOWER).\n• Experience with browser-based debugging, and error checking.\n• Automated unit testing tools such as Jest, Enzyme, React-testing-library and end-to-end testing tools such as, WebDriver IO, Cypress, or other Selenium-based technologies.\n• Experience with code versioning tools such as git.\n• Great time-management, interpersonal and communication skills.\n• Positive, can-do attitude and a Keen collaborator.",
            "job_apply_link": "https://www.ziprecruiter.com/c/Anagh-Technologies,-Inc./Job/Javascript-React-Developer/-in-West-Mclean,VA?jid=d707d5120915b404&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 50
        },
        {
            "job_title": "Back-end Java Software Engineer",
            "employer_name": "DocMe360",
            "job_description": "DocMe360 is seeking a talented Back-end Java Software Engineer to join our dynamic team. In this critical role, you will focus on developing robust and scalable server-side applications that drive our client solutions. Your expertise in Java and related technologies will enable you to create high-performance APIs and services that integrate seamlessly with front-end systems and databases. Working collaboratively with cross-functional teams, you will contribute to the full software development lifecycle to enhance existing systems and implement new features that align with our commitment to quality and innovation. This position may be contract, contract-to-hire, or direct hire.\n\nResponsibilities\n• Design and implement server-side applications and APIs using Java and related frameworks.\n• Collaborate with front-end developers, UX/UI designers, and other stakeholders to gather requirements and deliver effective solutions.\n• Optimize application performance and address any bottlenecks in the back-end.\n• Ensure system security, data integrity, and compliance with industry standards.\n• Implement testing frameworks and practices to ensure code quality and reliability.\n• Participate in code reviews and provide mentoring to junior engineers.\n• Stay updated with emerging technologies and industry trends to apply best practices in back-end development.\n\nDocMe360 Values\n• Delivery - Deliver all efforts through a culture of honesty, transparency, unwavering integrity, and professional growth.\n• Optimism - Optimize and invest in professional growth, empowerment, and well-being.\n• Collaboration - Collaborate for impact; foster teamwork and shared expertise to achieve success.\n• Motivation - Motivate from within to naturally inspire and energize clients with passion and purpose.\n• Exploration - Explore opportunities for innovative technologies and trends that align with our mission and foster the highest quality of products and services.\n\nRequirements\n• Must have 5 years experience and a bachelors degree (or 8 years experience)\n• Proven experience in Java programming and related frameworks (e.g., Spring, Hibernate).\n• Understanding of back-end development best practices, architecture patterns, and microservices.\n• Experience with RESTful APIs and web services.\n• Familiarity with database management systems (SQL and NoSQL).\n• Strong problem-solving skills and the ability to work collaboratively in a team environment.\n• Experience with version control systems (e.g., Git).\n• Good understanding of Agile methodologies and tools.\n• Must be a US Citizen, residing in the United States.\n• Willingness to pass a background check and obtain necessary security clearance.\n\nBenefits\n\nThe benefits listed below are for full-time W2 employees.\n• Health Care Plan (Medical, Dental & Vision)\n• Retirement Plan (401k, IRA)\n• Paid Time Off (Vacation, Sick & Public Holidays)\n• Family Leave (Maternity, Paternity)\n• Training & Development\n• Work From Home",
            "job_apply_link": "https://www.ziprecruiter.com/c/DocMe360/Job/Back-end-Java-Software-Engineer/-in-Arlington,VA?jid=18333ab64ab469a2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 30
        },
        {
            "job_title": "Java Full Stack Developer",
            "employer_name": "Deloitte",
            "job_description": "Are you an experienced, passionate pioneer in technology who wants to work in a collaborative environment? As an experienced Project Delivery Senior Analyst - Java Full Stack Developer you will have the ability to share new ideas and collaborate on projects as a consultant without the extensive demands of travel. If so, consider an opportunity with Deloitte under our Project Delivery Talent Model. Project Delivery Model (PDM) is a talent model that is tailored specifically for long-term, onsite client service delivery.\n\nRecruiting for this role ends on 7/1/2025.\n\nWork you'll do/Responsibilities\n\nJoin our team in implementing and deploying cloud migration strategies for government agencies. You will play a pivotal role in helping clients leverage cloud technology to enhance their services, reduce operational costs, and boost overall efficiency. Your work will make a tangible difference in how the public sector operates and serves its constituents. This is an exciting opportunity to work on impactful projects at the forefront of cloud adoption\n• Front-End Development Activities: Design and develop user interfaces (UIs) based on project requirements, using HTML, CSS, JavaScript, APIs.\n• Back-End Development Activities: Develop and implement APIs using server-side languages (e.g., Python, Node.js, Java, Go).\n• Full-Stack Development Activities: Develop end-to-end applications, working across the entire stack.\n• Cloud and Deployment Activities: Deploy applications on cloud platforms (GCP, AWS, Azure\n• Prototyping and Iteration: Rapidly develop prototypes that demonstrate the feasibility of customer use cases b) Iterate on prototypes based on customer feedback and technical requirements\n• Sales Play Integration: Contribute to the creation of technical documentation and architecture diagrams to help scale solutions.\n• Knowledge Sharing and Collaboration: a) Document code and create developer guides\n• Communicate regularly with Engagement Managers (Directors), project team members, and representatives from various functional and / or technical teams, including escalating any matters that require additional attention and consideration from engagement management\n• Independently and collaboratively lead client engagement workstreams focused on improvement, optimization, and transformation of processes including implementing leading practice workflows, addressing deficits in quality, and driving operational outcomes\n\nThe Team\n\nOur Core Technology Operations (CTO) team offers differentiated operate services for our clients with solutions to help organizations scale and optimize critical business operations, drive speed to outcome, deliver business transformation, and build resilience in an uncertain future.\n\nQualifications\n\nRequired\n• 3+ years' of experience with Full Stack Development\n• 3+ years of experience Design and develop user interfaces (UIs) based on project requirements, using HTML, CSS, JavaScript, APIs.\n• 3+ years of experience Back-End Development Activities: Develop and implement APIs using server-side languages (e.g., Python, Node.js, Java, Go).\n• Full-Stack Development Activities: Develop end-to-end applications, working across the entire stack.\n• Cloud and Deployment Activities: Deploy applications on cloud platforms (GCP, AWS, Azure\n• Bachelor's degree, preferably in Computer Science, Information Technology, Computer Engineering, or related IT discipline; or equivalent experience\n• Limited immigration sponsorship may be available\n• Ability to travel 10%, on average, based on the work you do and the clients and industries/sectors you serve\n\nPreferred\n• Analytical/ Decision Making Responsibilities\n• Analytical ability to manage multiple projects and prioritize tasks into manageable work products\n• Can operate independently or with minimum supervision\n• Excellent Written and Communication Skills\n• Ability to deliver technical demonstrations\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is 98,875- 163,125.\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\nInformation for applicants with a need for accommodation: https://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.",
            "job_apply_link": "https://jobsus.deloitte.com/hartford-ct/java-full-stack-developer/AA1145F1514340BE8F98762098641218/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "relevance_score": 50
        }
    ]
}